#### 라이브러리 설치 및 실행

In [3]:
#라이브러리 설치하기
!pip install pandas

Collecting pandas
  Downloading pandas-2.3.0-cp313-cp313-win_amd64.whl.metadata (19 kB)
Collecting numpy>=1.26.0 (from pandas)
  Downloading numpy-2.3.0-cp313-cp313-win_amd64.whl.metadata (60 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\1\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\1\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.0-cp313-cp313-win_amd64.whl (11.0 MB)
   ---------------------------------------- 0.0/11.0 MB ? eta -:--:--
   ------------------------------ --------- 8.4/11.0 MB 40.9 MB/s eta 0:00:01
   ---------------------------------------- 11.0/11.0 MB 38.2 MB/s eta 0:00:00
Downloading numpy-2.3.0-cp313-cp313-win_amd64.whl (12.7 MB)
   ---------------------------------------- 0.0/12.7 MB ? eta -:--:--
   ----------------------------------- ---- 11.3/12.7 MB 53.5 MB/s eta 0:00:01
   ---------------------------------------- 12.7/12.7 MB 45.4 MB/s eta 0:00:00
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Downloading tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, numpy, pandas

   ---------------------------------------- 0/4 [pytz]
   ---------------------------------------- 0/4 [pytz]
   ---------------------------------------- 0/4 [pytz]
   ---------------------------------------- 0/4 [pytz]
   ---------- ----------------------------- 1/4 [tzdata]
   ---------- ----------------------------- 1/4 [tzdata]
   ---------- ----------------------------- 1/4 [tzdata]
   ---------- ----------------------------- 1/4 [tzdata]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ---------------------------------------- 4/4 [pandas]

Successfully installed numpy-2.3.0 pandas-2.3.0 pytz-2025.2 tzdata-2025.2

In [18]:
#라이브러리 불러오기
import pandas as pd

### 시리즈

딕셔너리 -> 시리즈 변환

In [19]:
# k:v 구조를 갖는 딕셔너리를 만들고, 변수 dict_data에 저장
dict_data={'a':1, 'b':2, 'c':3}

In [20]:
# 판다스 Series()함수로 딕셔너리를 시리즈로 변환, 변수 sr에 저장
sr = pd.Series(dict_data)

In [21]:
#변수 sr의 자료형 출력
print(type(sr))

<class 'pandas.core.series.Series'>

In [22]:
# 변수 sr에 저장되어 있는 시리즈 객체를 출력
print(sr)

a    1
b    2
c    3
dtype: int64

시리즈 인덱스

In [23]:
import pandas as pd

# 리스트를 시리즈로 변환하여 변수 sr에 저장
list_data = ['2019-01-02', 3.14, 'ABC', 100, True]
sr = pd.Series(list_data)
print(sr)

0    2019-01-02
1          3.14
2           ABC
3           100
4          True
dtype: object

In [24]:
# 인덱스 배열은 변수 idx에 저장
idx = sr.index
print(idx)

RangeIndex(start=0, stop=5, step=1)

In [25]:
#데이터 값 배열은 변수 val에 저장
val = sr.values
print(val)

['2019-01-02' 3.14 'ABC' 100 True]

In [26]:
# 시리즈 배열을 구성하는 원소의 자료형
print(sr.dtype)

object

In [27]:
# 시리즈 배열의 크기
print(len(sr))

5

In [28]:
# 시리즈 배열의 형태
print(sr.shape)

(5,)

In [29]:
# 시리즈 배열의 차원
print(sr.ndim)

1

시리즈 원소 선택

In [31]:
import pandas as pd

# 투플을 시리즈로 변환(인덱스 옵션 지정)
tup_data = ('영인', '2010-05-01', '여', True)
sr = pd.Series(tup_data, index=['이름', '생년월일', '성별', '학생여부'])
print(sr)

이름              영인
생년월일    2010-05-01
성별               여
학생여부          True
dtype: object

In [34]:
# 원소 1개를 선택
print(sr[0]) # sr의 1번째 원소를 선택(정수형 위치 인덱스)
print(sr['이름']) # '이름' 라벨을 가진 원소를 선택 (인덱스 이름)

영인
영인

C:\Users\1\AppData\Local\Temp\ipykernel_23464\36602884.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(sr[0]) # sr의 1번째 원소를 선택(정수형 위치 인덱스)

In [37]:
# 여러 개의 원소를 선택(인덱스 리스트 활용)
print(sr[[1,2]])
print('\n')
print(sr[['생년월일', '성별']])

생년월일    2010-05-01
성별               여
dtype: object


생년월일    2010-05-01
성별               여
dtype: object

C:\Users\1\AppData\Local\Temp\ipykernel_23464\1670111577.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(sr[[1,2]])

In [38]:
# 여러 개의 원소를 선택(인덱스 범위 지정)
print(sr[1:2])
print('\n')
print(sr[['생년월일', '성별']])

생년월일    2010-05-01
dtype: object


생년월일    2010-05-01
성별               여
dtype: object

In [39]:
pd.Series()

Series([], dtype: object)

In [40]:
pd.Series(5)

0    5
dtype: int64

In [41]:
pd.Series(5, index=['a','b','c'])

a    5
b    5
c    5
dtype: int64

미션1-2

In [61]:
# 다음 학생들의 점수 데이터로 Series를 만들어보세요.
# 김철수: 85점, 이영희: 92점, 박민수: 78점, 최지연: 96점
ms1_data = [85, 92, 78, 96]
ms1 = pd.Series(ms1_data, index=['김철수', '이영희', '박민수', '최지연'])
print(ms1)

김철수    85
이영희    92
박민수    78
최지연    96
dtype: int64

미션1-3

In [62]:
# 이영희의 점수를 출력하세요
print(ms1['이영희'])

92

In [63]:
# 90점 이상인 학생들을 필터링하세요
high_scores = ms1[ms1>=90]
print(high_scores)

이영희    92
최지연    96
dtype: int64

In [65]:
# 모든 점수에 5점을 더해보세요
ms1_plus_5 = ms1 + 5
print(ms1_plus_5)

김철수     90
이영희     97
박민수     83
최지연    101
dtype: int64

### 데이터 프레임

#### 딕셔너리 -> 데이터 프레임 변환

In [67]:
# 열이름을  key로 하고, 리스트를 value로 갖는 딕셔너리 정의(2차원 배열)
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

In [68]:
# 판다스 DataFrame() 함수로 딕셔너리를 데이터 프레임으로 변환. 변수 df에 저장
df = pd.DataFrame(dict_data)

In [70]:
# df의 자료형 출력
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [71]:
# 변수df에 저장되어 있는 데이터프레임 객체를 출력
print(df)

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [72]:
# 주피터 환경에서 변수 출력
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

#### 행 인덱스/열 이름 설정

In [76]:
# 행 인덱스/열 이름 지정하여, 데이터 프레임 만들기
df = pd.DataFrame([[15, '남', '덕영중'], [17, '여', '수리중']], index=['준서', '예은'], columns=['나이', '성별', '학교'])
# 데이트 프레임 출력하기
print(df)

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [77]:
# 행 인덱스 확인하기
print(df.index)

Index(['준서', '예은'], dtype='object')

In [79]:
# 열 이름 확인하기
print(df.columns)

Index(['나이', '성별', '학교'], dtype='object')

In [81]:
# 행 인덱스, 열 이름 변경하기
df.index=['학생1', '학생2']
df.columns=['연령', '남녀', '소속']

print(df)
print('\n')
print(df.index)
print('\n')
print(df.columns)

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중


Index(['학생1', '학생2'], dtype='object')


Index(['연령', '남녀', '소속'], dtype='object')

In [82]:
# 행 인덱스/열 이름 지정하여, 데이터 프레임 만들기
df = pd.DataFrame([[15, '남', '덕영중'], [17, '여', '수리중']], index=['준서', '예은'], columns=['나이', '성별', '학교'])
# 데이트 프레임 출력하기
print(df)

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [84]:
# 열 이름 중, '나이'를 '연령'으로 '성별'을 '남녀'로 '학교'를 '소속'으로 바꾸기
df = df.rename(columns={'나이':'연령', '성별':'남녀', '학교':'소속'})

# df 출력(변경 후)
print(df)

    연령 남녀   소속
준서  15  남  덕영중
예은  17  여  수리중

In [85]:
# df의 행 인덱스 중에서 '준서'를 '학생1'로 '예은'을 '학생2'로 바꾸기
df = df.rename(index={'준서':'학생', '예은':'학생2'})

# df 출력
print(df)

     연령 남녀   소속
학생   15  남  덕영중
학생2  17  여  수리중

#### 행 삭제

In [87]:
exam_data ={'수학':[90,80,70], '영어':[98,89,95], '음악':[85,95,100], '체육':[100,90,90]}

df = pd.DataFrame(exam_data, index=['서준', '우현', '인아'])
print(df)

# 데이터프레임 df를 복제하여 변수 df2에 저장. df2의 1개 행(row) 삭제
df2 = df.copy()
df2 = df2.drop('우현')
print(df2)

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90
    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [88]:
# 데이터프레임 df를 복제하여 변수 df3에 저장, df3의 2개 행(row) 삭제
df3 = df.copy()
df3 = df3.drop(['우현', '인아'], axis = 0)
print(df3)

    수학  영어  음악   체육
서준  90  98  85  100

In [89]:
# 데이터프레임 df를 복제하여 변수 df4에 저장, df4의 2개 행(row) 삭제
# axis = 0 대신 axis = 'index'를 축 옵션으로 적용할 수 있음
df4 = df.copy()
df4 = df4.drop(['우현', '인아'], axis = 'index')
print(df4)

    수학  영어  음악   체육
서준  90  98  85  100

In [90]:
# 데이터프레임 df를 복제하여 변수 df5에 저장, df5의 1개 행(row) 삭제
df5 = df.copy()
df5 = df5.drop(index=['우현'])
print(df5)

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

#### 열 삭제

In [91]:
exam_data ={'수학':[90,80,70], '영어':[98,89,95], '음악':[85,95,100], '체육':[100,90,90]}

df = pd.DataFrame(exam_data, index=['서준', '우현', '인아'])
print(df)

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [92]:
# 데이터프레임 df를 복제하여 변수 df2에 저장. df2의 1개 열(columns) 삭제
df2 = df.copy()
df2 = df2.drop('수학', axis =1)
print(df2)

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

In [93]:
# 데이터프레임 df를 복제하여 변수 df3에 저장, df3의 2개 열(columns) 삭제
df3 = df.copy()
df3 = df3.drop(['영어', '음악'], axis = 1)
print(df3)

    수학   체육
서준  90  100
우현  80   90
인아  70   90

In [94]:
# 데이터프레임 df를 복제하여 변수 df4에 저장, df4의 2개 열(columns) 삭제
# axis = 1 대신 axis = 'columns'를 축 옵션으로 적용할 수 있음
df4 = df.copy()
df4 = df4.drop(['영어', '음악'], axis = 'columns')
print(df4)

    수학   체육
서준  90  100
우현  80   90
인아  70   90

In [95]:
# 데이터프레임 df를 복제하여 변수 df5에 저장, df5의 1개 열(columns) 삭제
df5 = df.copy()
df5 = df5.drop(columns=['수학'])
print(df5)

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

#### 행 선택

In [117]:
exam_data ={'수학':[90,80,70], '영어':[98,89,95], '음악':[85,95,100], '체육':[100,90,90]}

df = pd.DataFrame(exam_data, index=['서준', '우현', '인아'])
print(df)

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [118]:
# 행 인덱스를 사용하여 행 1개 선택
label1 = df. loc['서준'] #loc 인덱서 활용
position1 = df.iloc[0] #iloc 인덱서 활용

print(label1)
print(position1)

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64
수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [123]:
# 행 인덱스를 사용하여 2개 이상의 행 선택
label2 = df.loc[['서준', '우현']] #loc 인덱서 활용
position2 = df.iloc[[0, 1]] #iloc 인덱서 활용

print(label2)
print(position2)

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90
    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

In [124]:
# 행 인덱스의 범위를 지정하여 행 선택
label3 = df.loc['서준':'우현'] #loc 인덱서 활용
position3 = df.iloc[0:1] #iloc 인덱서 활용

print(label3)
print(position3)

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90
    수학  영어  음악   체육
서준  90  98  85  100

#### 열 선택

In [127]:
exam_data ={'수학':[90,80,70], '영어':[98,89,95], '음악':[85,95,100], '체육':[100,90,90]}

df = pd.DataFrame(exam_data, index=['서준', '우현', '인아'])
print(df)
print(type(df))

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90
<class 'pandas.core.frame.DataFrame'>

In [129]:
# '수학'점수 데이터만 선택. 변수 math1 에 저장
math1 = df['수학'] 
print(math1)
print(type(math1))

서준    90
우현    80
인아    70
Name: 수학, dtype: int64
<class 'pandas.core.series.Series'>

In [131]:
# '영어'점수 데이터만 선택. 변수 math1 에 저장
english = df['영어'] 
print(english)
print(type(english))

서준    98
우현    89
인아    95
Name: 영어, dtype: int64
<class 'pandas.core.series.Series'>

In [132]:
# '음악', '체육' 점수 데이터를 선택, 변수 music_gym에 저장
music_gym = df[['음악', '체육']]
print(music_gym)
print(type(music_gym))

     음악   체육
서준   85  100
우현   95   90
인아  100   90
<class 'pandas.core.frame.DataFrame'>

In [133]:
# '수학'점수 데이터만 선택. 변수 math2 에 저장
math2 = df['수학'] 
print(math2)
print(type(math2))

서준    90
우현    80
인아    70
Name: 수학, dtype: int64
<class 'pandas.core.series.Series'>

#### 미션 2-1

In [102]:
# 다음 학생 정보로 DataFrame을 생성하세요
'''이름	나이	성별	점수
김철수	20	남	85
이영희	19	여	92
박민수	21	남	78
최지연	20	여	96'''

'이름\t나이\t성별\t점수\n김철수\t20\t남\t85\n이영희\t19\t여\t92\n박민수\t21\t남\t78\n최지연\t20\t여\t96'

In [179]:
ms2_data = {'이름':['김철수', '이영희', '박민수', '최지연'],
            '나이':[20,19,21,20],
            '성별':['남', '여', '남', '여'],
            '점수':[85,92,78,96]}

ms2 = pd.DataFrame(ms2_data)
ms2

    이름  나이 성별  점수
0  김철수  20  남  85
1  이영희  19  여  92
2  박민수  21  남  78
3  최지연  20  여  96

#### 미션 2-2

In [107]:
# 기본 정보를 확인하세요 (info(), describe(), shape)
print(ms2_data.info())
print('\n')
print(ms2_data.describe())
print('\n')
print(ms2_data.shape)

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 김철수 to 최지연
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   나이      4 non-null      int64
 1   성별      4 non-null      object
 2   점수      4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 128.0+ bytes
None


              나이         점수
count   4.000000   4.000000
mean   20.000000  87.750000
std     0.816497   7.932003
min    19.000000  78.000000
25%    19.750000  83.250000
50%    20.000000  88.500000
75%    20.250000  93.000000
max    21.000000  96.000000


(4, 3)

In [110]:
# 첫 2행을 출력하세요
print(ms2_data.iloc[1])

나이    19
성별     여
점수    92
Name: 이영희, dtype: object

In [113]:
# '점수' 열만 선택해서 출력하세요
print(ms2_data['점수'])

김철수    85
이영희    92
박민수    78
최지연    96
Name: 점수, dtype: int64

#### 범위 슬라이싱의 고급 활용

In [135]:
# 범위 슬라이싱: DataFrame 객체.iloc[시작인덱스:끝인덱스:슬라이싱 간격]
df.iloc[::2]

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [136]:
df.iloc[0:3:2]

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [137]:
df.iloc[::-1]

    수학  영어   음악   체육
인아  70  95  100   90
우현  80  89   95   90
서준  90  98   85  100

#### 원소 선택

In [140]:
# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장
exam_data = {'이름':['서준','우현','인아'],
            '수학':[90,80,70],
            '영어':[98,89,95],
            '음악':[85,95,100],
            '체육':[100,90,90]}

df = pd.DataFrame(exam_data)

# '이름' 열을 새로운 인덱스로 지정하고 df 객체에 변경 사항 반영
df = df.set_index('이름')
print(df)
print(exam_data)

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90
{'이름': ['서준', '우현', '인아'], '수학': [90, 80, 70], '영어': [98, 89, 95], '음악': [85, 95, 100], '체육': [100, 90, 90]}

In [141]:
# 데이터프레임 df의 특정 원소 1개 선택('서준'의 '음악' 점수)
a = df.loc['서준','음악']
print(a)

b=df.iloc[0,2]
print(b)

85
85

In [145]:
# 데이터프레임 df의 특정 원소 2개 이상 선택('서준'의 '음악', '체육' 점수)
c=df.loc['서준', ['음악','체육']]
print(c)
d=df.iloc[0, [2,3]]
print(d)
e=df.loc['서준', '음악':'체육']
print(e)
f=df.iloc[0,2:]
print(f)

음악     85
체육    100
Name: 서준, dtype: int64
음악     85
체육    100
Name: 서준, dtype: int64
음악     85
체육    100
Name: 서준, dtype: int64
음악     85
체육    100
Name: 서준, dtype: int64

In [146]:
# df 2개 이상의 행과 열에 속하는 원소들 선택('서준', '우현'의 '음악', '체육' 점수)
g=df.loc[['서준','우현'], ['음악','체육']]
print(g)
h=df.iloc[[0,1], [2,3]]
print(h)
i=df.loc['서준':'우현', '음악':'체육']
print(i)
j=df.iloc[0:2,2:]
print(j)

    음악   체육
이름
서준  85  100
우현  95   90
    음악   체육
이름
서준  85  100
우현  95   90
    음악   체육
이름
서준  85  100
우현  95   90
    음악   체육
이름
서준  85  100
우현  95   90

#### 열 추가

In [148]:
# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장
exam_data = {'이름':['서준','우현','인아'],
            '수학':[90,80,70],
            '영어':[98,89,95],
            '음악':[85,95,100],
            '체육':[100,90,90]}

df = pd.DataFrame(exam_data)
print(df)

# 데이터프레임 df에 '국어'점수 열(columns) 추가. 데이터 값은 80 지정
df['국어']=80
print(df)

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90
   이름  수학  영어   음악   체육  국어
0  서준  90  98   85  100  80
1  우현  80  89   95   90  80
2  인아  70  95  100   90  80

In [151]:
# 데이터프레임 df에 '미술'점수 열(columns) 추가. 데이터 값은 [80,90,100] 지정
df['미술']=[80,90,100]
print(df)
df

   이름  수학  영어   음악   체육  국어   미술
0  서준  90  98   85  100  80   80
1  우현  80  89   95   90  80   90
2  인아  70  95  100   90  80  100

   이름  수학  영어   음악   체육  국어   미술
0  서준  90  98   85  100  80   80
1  우현  80  89   95   90  80   90
2  인아  70  95  100   90  80  100

#### 행 추가

In [157]:
# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장
exam_data = {'이름':['서준','우현','인아'],
            '수학':[90,80,70],
            '영어':[98,89,95],
            '음악':[85,95,100],
            '체육':[100,90,90]}

df = pd.DataFrame(exam_data)
print(df)

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [158]:
# 새로운 행(row) 추가 - 같은 원소 값 입력
df.loc[3]=0
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90
3   0   0   0    0    0

In [160]:
# 새로운 행(row) 추가 - 원소 값 여러 개의 배열 입력
df.loc[4]=['동규', 90,80,70,60]
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90
3   0   0   0    0    0
4  동규  90  80   70   60

In [161]:
# 새로운 행(row) 추가 - 기존 행 복사
df.loc['행5']=df.loc[3]
df

    이름  수학  영어   음악   체육
0   서준  90  98   85  100
1   우현  80  89   95   90
2   인아  70  95  100   90
3    0   0   0    0    0
4   동규  90  80   70   60
행5   0   0   0    0    0

#### 원소 값 변경

In [163]:
# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장
exam_data = {'이름':['서준','우현','인아'],
            '수학':[90,80,70],
            '영어':[98,89,95],
            '음악':[85,95,100],
            '체육':[100,90,90]}

df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [164]:
# '이름' 열을 새로운 인덱스로 지정하고 df 객체에 변경사항 반영
df = df.set_index('이름')
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [165]:
# 데이터프레임 df의 특정 원소를 변경하는 방법 : '서준'의 '체육' 점수
df.iloc[0][3]=80
df

C:\Users\1\AppData\Local\Temp\ipykernel_23464\3839669103.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df.iloc[0][3]=80
C:\Users\1\AppData\Local\Temp\ipykernel_23464\3839669103.py:2: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  df.iloc[0][3]=80

    수학  영어   음악  체육
이름
서준  90  98   85  80
우현  80  89   95  90
인아  70  95  100  90

In [167]:
df.loc['서준']['체육']= 90
df

C:\Users\1\AppData\Local\Temp\ipykernel_23464\2444169256.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df.loc['서준']['체육']= 90

    수학  영어   음악  체육
이름
서준  90  98   85  90
우현  80  89   95  90
인아  70  95  100  90

In [168]:
df.loc['서준']['체육']= 100
df

C:\Users\1\AppData\Local\Temp\ipykernel_23464\658491212.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df.loc['서준']['체육']= 100

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [169]:
# 데이터프레임 df의 원소 여러 개를 변경하는 방법: '서준'의 '음악','체육' 점수
df.loc['서준', ['음악', '체육']] = 50
df

    수학  영어   음악  체육
이름
서준  90  98   50  50
우현  80  89   95  90
인아  70  95  100  90

In [170]:
df.loc['서준', ['음악', '체육']] = 100, 50
df

    수학  영어   음악  체육
이름
서준  90  98  100  50
우현  80  89   95  90
인아  70  95  100  90

#### 행, 열의 위치 바꾸기

In [172]:
# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장
exam_data = {'이름':['서준','우현','인아'],
            '수학':[90,80,70],
            '영어':[98,89,95],
            '음악':[85,95,100],
            '체육':[100,90,90]}

df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [173]:
# 데이터프레임 df를 전치하기(메소드 활용)
df= df.transpose()
print(df)

      0   1    2
이름   서준  우현   인아
수학   90  80   70
영어   98  89   95
음악   85  95  100
체육  100  90   90

In [174]:
# 데이터프레임 df를 다시 전치하기(클래스 속성 활용)
df=df.T
print(df)

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

#### 미션3-1

In [184]:
#위에서 만든 student DataFrame에서:
ms2_data = {'이름':['김철수', '이영희', '박민수', '최지연'],
            '나이':[20,19,21,20],
            '성별':['남', '여', '남', '여'],
            '점수':[85,92,78,96]}

ms2 = pd.DataFrame(ms2_data)
ms2

    이름  나이 성별  점수
0  김철수  20  남  85
1  이영희  19  여  92
2  박민수  21  남  78
3  최지연  20  여  96

In [200]:
# loc을 사용해서 이영희의 모든 정보를 출력하세요
result = ms2.loc[ms2['이름'] == '이영희']
result

    이름  나이 성별  점수
1  이영희  19  여  92

In [199]:
# iloc을 사용해서 첫 번째와 세 번째 행의 '이름'과 '점수'를 출력하세요
result = ms2.iloc[[0, 2], [0, 3]]
result

    이름  점수
0  김철수  85
2  박민수  78

In [198]:
#나이가 20살인 학생들을 필터링하세요
age_20 = ms2[ms2['나이'] == 20]
age_20

    이름  나이 성별  점수
0  김철수  20  남  85
3  최지연  20  여  96

#### 미션3-2

In [201]:
# 새로운 학생 '정민호(22세, 남, 88점)'를 추가하세요
ms2.loc[4]=['정민호', 22, '남', 88]
ms2

    이름  나이 성별  점수
0  김철수  20  남  85
1  이영희  19  여  92
2  박민수  21  남  78
3  최지연  20  여  96
4  정민호  22  남  88

In [203]:
# 모든 학생의 점수에 3점을 더하세요
ms2['점수'] = ms2['점수'] + 3
ms2

    이름  나이 성별  점수
0  김철수  20  남  88
1  이영희  19  여  95
2  박민수  21  남  81
3  최지연  20  여  99
4  정민호  22  남  91

In [204]:
# '등급' 열을 추가하세요 (90점 이상: A, 80-89점: B, 80점 미만: C)
ms2['등급'] = ms2['점수'].apply(lambda x: 'A' if x >= 90 else ('B' if x >= 80 else 'C'))
ms2

    이름  나이 성별  점수 등급
0  김철수  20  남  88  B
1  이영희  19  여  95  A
2  박민수  21  남  81  B
3  최지연  20  여  99  A
4  정민호  22  남  91  A

### 인덱스 활용

#### 특정 열을 행 인덱스로 설정

In [205]:
# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장
exam_data = {'이름':['서준','우현','인아'],
            '수학':[90,80,70],
            '영어':[98,89,95],
            '음악':[85,95,100],
            '체육':[100,90,90]}

df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [208]:
# 특정 열(column)을 데이터프레임의 행 인덱스(index)로 설정
ndf = df. set_index(['이름'])
print(ndf)

ndf2 = ndf. set_index(['음악'])
print(ndf2)

ndf3 = ndf. set_index(['수학', '음악'])
print(ndf3)

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90
     수학  영어   체육
음악
85   90  98  100
95   80  89   90
100  70  95   90
        영어   체육
수학 음악
90 85   98  100
80 95   89   90
70 100  95   90

#### 행 인덱스 재배열
##### 새로운 배열로 행 인덱스를 재지정

In [209]:
# 딕셔너리를 데이터프레임으로 전환
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

# 인덱스를 ['r0', 'r1', 'r2']로 지정
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
print(df)

# 인덱스를 ['r0', 'r1', 'r2', 'r3', 'r4']로 재지정
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']
ndf = df.reindex(new_index)
print(ndf)

# reindex로 발생한 NAN값을 숫자 0으로 채우기
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']
ndf2 = df.reindex(new_index, fill_value=0)
print(ndf2)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r2  3.0  6.0  9.0  12.0  15.0
r3  NaN  NaN  NaN   NaN   NaN
r4  NaN  NaN  NaN   NaN   NaN
    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

#### 행 인덱스 초기화

In [210]:
# 딕셔너리를 데이터프레임으로 전환
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

# 인덱스를 ['r0', 'r1', 'r2']로 지정
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
print(df)

# 행 인덱스를 정수형으로 초기화
ndf = df.reset_index()
print(ndf)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15

In [211]:
# 행 인덱스를 정수형으로 초기화하고 기존 이덱스의 열 이름을 지정
ndf2 = df.reset_index(names=['C00'])
ndf2

  C00  c0  c1  c2  c3  c4
0  r0   1   4   7  10  13
1  r1   2   5   8  11  14
2  r2   3   6   9  12  15

In [212]:
# 행 인덱스를 초기화하고, 기존 인덱스를 삭제
ndf3 = df.reset_index(drop = True)
ndf3

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

#### 행 인덱스를 기준으로 데이터프레임 정렬

In [213]:
# 딕셔너리를 데이터프레임으로 전환
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

# 인덱스를 ['r0', 'r1', 'r2']로 지정
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
print(df)

# 내림차순으로 행 인덱스 정렬
ndf = df.sort_index(ascending=False)
ndf

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [214]:
# 오름차순으로 행 인덱스 정렬
ndf2 = df.sort_index(ascending=True)
ndf2

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

#### 열 기준으로 데이터프레임 정렬

In [222]:
# 딕셔너리를 데이터프레임으로 전환
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,10,11], 'c4':[15,14,14]}

# 인덱스를 ['r0', 'r1', 'r2']로 지정
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
print(df)

#c1 열을 기준으로 내림차순 정렬
ndf = df.sort_values(by='c1', ascending = False)
ndf

    c0  c1  c2  c3  c4
r0   1   4   7  10  15
r1   2   5   8  10  14
r2   3   6   9  11  14

    c0  c1  c2  c3  c4
r2   3   6   9  11  14
r1   2   5   8  10  14
r0   1   4   7  10  15

In [223]:
#c2 열을 기준으로 오름차순 정렬
ndf2 = df.sort_values(by='c2', ascending = True)
ndf2

    c0  c1  c2  c3  c4
r0   1   4   7  10  15
r1   2   5   8  10  14
r2   3   6   9  11  14

In [224]:
#c3 열을 기준으로 내림차순 정렬, c4 열을 기준으로 오름차순 정렬(즉, 배열의 순서대로 우선순위가 적용됨)
ndf3 = df.sort_values(by=['c3','c4'], ascending=[False, True])
ndf3

    c0  c1  c2  c3  c4
r2   3   6   9  11  14
r1   2   5   8  10  14
r0   1   4   7  10  15

### 산술연산

#### 시리즈 연산

In [229]:
# 시리즈를 숫자로 나누기
# 딕셔너리 데이터로 판다스 시리즈 만들기
student1 = pd.Series({'국어':100, '영어': 80, '수학':90})
print(student1)

# 학생의 과목별 점수를 200으로 나누기
percentage = student1/200
print(percentage)
print(type(percentage))

국어    100
영어     80
수학     90
dtype: int64
국어    0.50
영어    0.40
수학    0.45
dtype: float64
<class 'pandas.core.series.Series'>

In [230]:
# 시리즈를 사칙연산
# 딕셔너리 데이터로 판다스 시리즈 만들기
student1 = pd.Series({'국어':100, '영어': 80, '수학':90})
student2 = pd.Series({'수학':80, '국어': 90, '영어':80})

print(student1)
print(student2)

# 두 학생의 과목별 점수로 사칙연산 수행
addition = student1+student2  # 덧셈
print(addition)
print(type(addition))

국어    100
영어     80
수학     90
dtype: int64
수학    80
국어    90
영어    80
dtype: int64
국어    190
수학    170
영어    160
dtype: int64
<class 'pandas.core.series.Series'>

In [231]:
subtraction = student1-student2 # 뺄셈
print(subtraction)
print(type(subtraction))

국어    10
수학    10
영어     0
dtype: int64
<class 'pandas.core.series.Series'>

In [232]:
multiplication = student1*student2 # 곱셈
print(multiplication)
print(type(multiplication))

국어    9000
수학    7200
영어    6400
dtype: int64
<class 'pandas.core.series.Series'>

In [233]:
division = student1/student2 # 나눗셈
print(division)
print(type(division))

국어    1.111111
수학    1.125000
영어    1.000000
dtype: float64
<class 'pandas.core.series.Series'>

In [234]:
# 사칙연산 결과를 데이터프레임으로 합치기(시리즈 -> 데이터프레임)
result = pd.DataFrame([addition, subtraction, multiplication, division], index=['덧셈', '뺄셈','곱셈','나눗셈'])
result

              국어        수학      영어
덧셈    190.000000   170.000   160.0
뺄셈     10.000000    10.000     0.0
곱셈   9000.000000  7200.000  6400.0
나눗셈     1.111111     1.125     1.0

In [237]:
#NaN 값이 있는 시리즈 연산
import pandas as pd
import numpy as np

student1 = pd.Series({'국어':np.nan, '영어': 80, '수학':90})
student2 = pd.Series({'수학':80, '국어': 90})

print(student1)
print(student2)

# 두 학생의 과목별 점수로 사칙연산 수행(시리즈 VS 시리즈)
addition = student1+student2  # 덧셈
subtraction = student1-student2 # 뺄셈
multiplication = student1*student2 # 곱셈
division = student1/student2 # 나눗셈
print(type(division))
print('\n')

# 사칙연산 결과를 데이터프레임으로 합치기 (시리즈 -> 데이터프레임)
result = pd.DataFrame([addition, subtraction, multiplication, division], index=['덧셈', '뺄셈','곱셈','나눗셈'])
result

국어     NaN
영어    80.0
수학    90.0
dtype: float64
수학    80
국어    90
dtype: int64
<class 'pandas.core.series.Series'>

     국어        수학  영어
덧셈  NaN   170.000 NaN
뺄셈  NaN    10.000 NaN
곱셈  NaN  7200.000 NaN
나눗셈 NaN     1.125 NaN

In [238]:
# 연산메소드 사용 - 시리즈 연산
import pandas as pd
import numpy as np

student1 = pd.Series({'국어':np.nan, '영어': 80, '수학':90})
student2 = pd.Series({'수학':80, '국어': 90})

print(student1)
print(student2)

# 두 학생의 과목별 점수로 사칙연산 수행(연산 메소드 사용)
sr_add = student1.add(student2, fill_value=0) #덧셈
sr_sub = student1.sub(student2, fill_value=0) #덧셈
sr_mul = student1.mul(student2, fill_value=0) #덧셈
sr_div = student1.div(student2, fill_value=0) #덧셈

# 사칙연산 결과를 데이터프레임으로 합치기(시리즈 -> 데이터프레임)
result = pd.DataFrame([sr_add, sr_sub, sr_mul, sr_div], index=['덧셈', '뺄셈','곱셈','나눗셈'])
result

국어     NaN
영어    80.0
수학    90.0
dtype: float64
수학    80
국어    90
dtype: int64

       국어        수학    영어
덧셈   90.0   170.000  80.0
뺄셈  -90.0    10.000  80.0
곱셈    0.0  7200.000   0.0
나눗셈   0.0     1.125   inf

#### 데이터프레임 연산

In [241]:
!pip install seaborn

Collecting seaborn
  Downloading seaborn-0.13.2-py3-none-any.whl.metadata (5.4 kB)
Requirement already satisfied: numpy!=1.24.0,>=1.20 in c:\users\1\appdata\local\programs\python\python313\lib\site-packages (from seaborn) (2.3.0)
Requirement already satisfied: pandas>=1.2 in c:\users\1\appdata\local\programs\python\python313\lib\site-packages (from seaborn) (2.3.0)
Collecting matplotlib!=3.6.1,>=3.4 (from seaborn)
  Downloading matplotlib-3.10.3-cp313-cp313-win_amd64.whl.metadata (11 kB)
Collecting contourpy>=1.0.1 (from matplotlib!=3.6.1,>=3.4->seaborn)
  Downloading contourpy-1.3.2-cp313-cp313-win_amd64.whl.metadata (5.5 kB)
Collecting cycler>=0.10 (from matplotlib!=3.6.1,>=3.4->seaborn)
  Downloading cycler-0.12.1-py3-none-any.whl.metadata (3.8 kB)
Collecting fonttools>=4.22.0 (from matplotlib!=3.6.1,>=3.4->seaborn)
  Downloading fonttools-4.58.2-cp313-cp313-win_amd64.whl.metadata (108 kB)
Collecting kiwisolver>=1.3.1 (from matplotlib!=3.6.1,>=3.4->seaborn)
  Downloading kiwisolver-1.4.8-cp313-cp313-win_amd64.whl.metadata (6.3 kB)
Requirement already satisfied: packaging>=20.0 in c:\users\1\appdata\local\programs\python\python313\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (25.0)
Collecting pillow>=8 (from matplotlib!=3.6.1,>=3.4->seaborn)
  Downloading pillow-11.2.1-cp313-cp313-win_amd64.whl.metadata (9.1 kB)
Collecting pyparsing>=2.3.1 (from matplotlib!=3.6.1,>=3.4->seaborn)
  Downloading pyparsing-3.2.3-py3-none-any.whl.metadata (5.0 kB)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\1\appdata\local\programs\python\python313\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\1\appdata\local\programs\python\python313\lib\site-packages (from pandas>=1.2->seaborn) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\1\appdata\local\programs\python\python313\lib\site-packages (from pandas>=1.2->seaborn) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\1\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.7->matplotlib!=3.6.1,>=3.4->seaborn) (1.17.0)
Downloading seaborn-0.13.2-py3-none-any.whl (294 kB)
Downloading matplotlib-3.10.3-cp313-cp313-win_amd64.whl (8.1 MB)
   ---------------------------------------- 0.0/8.1 MB ? eta -:--:--
   ------------------------ --------------- 5.0/8.1 MB 25.5 MB/s eta 0:00:01
   ---------------------------------------- 8.1/8.1 MB 21.4 MB/s eta 0:00:00
Downloading contourpy-1.3.2-cp313-cp313-win_amd64.whl (223 kB)
Downloading cycler-0.12.1-py3-none-any.whl (8.3 kB)
Downloading fonttools-4.58.2-cp313-cp313-win_amd64.whl (2.2 MB)
   ---------------------------------------- 0.0/2.2 MB ? eta -:--:--
   ---------------------------------------- 2.2/2.2 MB 43.3 MB/s eta 0:00:00
Downloading kiwisolver-1.4.8-cp313-cp313-win_amd64.whl (71 kB)
Downloading pillow-11.2.1-cp313-cp313-win_amd64.whl (2.7 MB)
   ---------------------------------------- 0.0/2.7 MB ? eta -:--:--
   ---------------------------------------- 2.7/2.7 MB 49.6 MB/s eta 0:00:00
Downloading pyparsing-3.2.3-py3-none-any.whl (111 kB)
Installing collected packages: pyparsing, pillow, kiwisolver, fonttools, cycler, contourpy, matplotlib, seaborn

   ----- ---------------------------------- 1/8 [pillow]
   ----- ---------------------------------- 1/8 [pillow]
   ----- ---------------------------------- 1/8 [pillow]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   --------------- ------------------------ 3/8 [fonttools]
   ------------------------- -------------- 5/8 [contourpy]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ------------------------------ --------- 6/8 [matplotlib]
   ----------------------------------- ---- 7/8 [seaborn]
   ----------------------------------- ---- 7/8 [seaborn]
   ----------------------------------- ---- 7/8 [seaborn]
   ---------------------------------------- 8/8 [seaborn]

Successfully installed contourpy-1.3.2 cycler-0.12.1 fonttools-4.58.2 kiwisolver-1.4.8 matplotlib-3.10.3 pillow-11.2.1 pyparsing-3.2.3 seaborn-0.13.2

In [242]:
import pandas as pd
import seaborn as sns

# titanic 데이터셋에서 age, fare 2개 열을 선택하여 데이터프레임 만들기
titanic = sns.load_dataset('titanic')
df=titanic.loc[:,['age', 'fare']]
print(df.head())
print('\n')
print(type(df))

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500


<class 'pandas.core.frame.DataFrame'>

In [243]:
# 데이터프레임에 숫자 10더하기
addition = df +10
print(addition.head())
print(type(addition))

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500
<class 'pandas.core.frame.DataFrame'>

In [244]:
# 데이터프레임끼리 더하기
# titanic 데이터셋에서 age, fare 2개 열을 선택하여 데이터프레임 만들기
titanic = sns.load_dataset('titanic')
df=titanic.loc[:,['age', 'fare']]
print(df.tail())
print('\n')
print(type(df))
print('\n')

# 데이터프레임에 숫자 10 더하기
addition = df +10
print(addition.tail())
print('\n')
print(type(addition))
print('\n')

# 데이터프레임끼리 연산하기(addition- df)
subtraction = addition-df
print(subtraction.tail())
print('\n')
print(type(subtraction))

      age   fare
886  27.0  13.00
887  19.0  30.00
888   NaN  23.45
889  26.0  30.00
890  32.0   7.75


<class 'pandas.core.frame.DataFrame'>


      age   fare
886  37.0  23.00
887  29.0  40.00
888   NaN  33.45
889  36.0  40.00
890  42.0  17.75


<class 'pandas.core.frame.DataFrame'>


      age  fare
886  10.0  10.0
887  10.0  10.0
888   NaN  10.0
889  10.0  10.0
890  10.0  10.0


<class 'pandas.core.frame.DataFrame'>

In [245]:
# 사칙연산 수행(연산 메소드 사용)
sample1 = addition.tail()
sample2 = subtraction.tail().fillna(0.0)

print(sample1)
print(sample2)

      age   fare
886  37.0  23.00
887  29.0  40.00
888   NaN  33.45
889  36.0  40.00
890  42.0  17.75
      age  fare
886  10.0  10.0
887  10.0  10.0
888   0.0  10.0
889  10.0  10.0
890  10.0  10.0

In [248]:
# 데이터프레임끼리 더하기
df_add= sample1.add(sample2, fill_value=0) #덧셈
df_sub= sample1.sub(sample2, fill_value=0) #뺄셈
df_mul= sample1.mul(sample2, fill_value=0) #곱셈
df_div= sample1.div(sample2, fill_value=0) #나눗셈

print(df_add)
print(df_sub)
print(df_mul)
print(df_div)

      age   fare
886  47.0  33.00
887  39.0  50.00
888   0.0  43.45
889  46.0  50.00
890  52.0  27.75
      age   fare
886  27.0  13.00
887  19.0  30.00
888   0.0  23.45
889  26.0  30.00
890  32.0   7.75
       age   fare
886  370.0  230.0
887  290.0  400.0
888    0.0  334.5
889  360.0  400.0
890  420.0  177.5
     age   fare
886  3.7  2.300
887  2.9  4.000
888  NaN  3.345
889  3.6  4.000
890  4.2  1.775

### 필터링

#### 불린인덱싱

In [258]:
import pandas as pd
import seaborn as sns

# titanic 데이터셋에서 age, fare 2개 열을 선택하여 데이터프레임 만들기
titanic = sns.load_dataset('titanic')

# 행 인덱스 0~9qjadnldptj  age, fare 2개 열을 선택하여 데이터 프레임 만들기
df=titanic.loc[0:9,['age', 'fare']]
df

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500
5   NaN   8.4583
6  54.0  51.8625
7   2.0  21.0750
8  27.0  11.1333
9  14.0  30.0708

In [250]:
# 조건식 적용(20세 미만: age<20)
df['age']<20

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
8    False
9     True
Name: age, dtype: bool

In [251]:
# 불린 인덱싱(20세 미만의 조건을 충족하는 행 필터링)
df[df['age'] < 20]

    age     fare
7   2.0  21.0750
9  14.0  30.0708

In [252]:
# 불린 인덱싱(loc 인덱서 활용)
df.loc[df['age'] <20]

    age     fare
7   2.0  21.0750
9  14.0  30.0708

In [253]:
# 불린 인덱싱(NOT 논리 연산)
df.loc[~(df['age'] <20)]

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500
5   NaN   8.4583
6  54.0  51.8625
8  27.0  11.1333

In [254]:
# 나이가 10대(10~19세)인 승객(AND 논리 연산)
mask1 = (titanic.age >= 10) & (titanic.age <20)
df_teenage= titanic[mask1]
df_teenage.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
14,0,3,female,14.0,0,0,7.8542,S,Third,child,False,NaN,Southampton,no,True
22,1,3,female,15.0,0,0,8.0292,Q,Third,child,False,NaN,Queenstown,yes,True
27,0,1,male,19.0,3,2,263.0000,S,First,man,True,C,Southampton,no,False
38,0,3,female,18.0,2,0,18.0000,S,Third,woman,False,NaN,Southampton,no,False

In [271]:
# 나이가 10세 미만(0~9세)이고 여성인 승객(AND 논리 연산, loc 인덱서)
mask2 = (titanic.age < 10) & (titanic.sex == 'Female')
df_female_under10= titanic.loc[mask2]
df_female_under10.head()

Empty DataFrame
Columns: [survived, pclass, sex, age, sibsp, parch, fare, embarked, class, who, adult_male, deck, embark_town, alive, alone]
Index: []

In [268]:
mask2 = (titanic.age < 10) & (titanic.sex == 'female')

In [269]:
print(mask2.head())

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [270]:
print(titanic.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

In [272]:
# 나이가 10세 미만(0~9세) 또는 60세 이상인 승객(OR 논리연산)
# age, sex, alone 열만 선택(loc 인덱서, fancy indexing)
mask3 = (titanic.age < 10) | (titanic.age >= 60)
df_under10_morethan60 = titanic.loc[mask3, ['age', 'sex', 'alone']]
df_under10_morethan60.head()

     age     sex  alone
7    2.0    male  False
10   4.0  female  False
16   2.0    male  False
24   8.0  female  False
33  66.0    male   True

In [273]:
# 불린 시리즈를 새로운 열로 추가
df['age_under_20']=df['age']<20
df.head()

    age     fare  age_under_20
0  22.0   7.2500         False
1  38.0  71.2833         False
2  26.0   7.9250         False
3  35.0  53.1000         False
4  35.0   8.0500         False